In [33]:
import pandas as pd
import numpy as np

In [4]:
train = pd.read_csv('train.csv')

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S

In [6]:
train.shape

(100000, 12)

In [7]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,100000.000000,100000.000000,100000.000000,96708.000000,100000.000000,100000.000000,99866.00000
mean,49999.500000,0.427740,2.106910,38.355472,0.397690,0.454560,43.92933
std,28867.657797,0.494753,0.837727,18.313556,0.862566,0.950076,69.58882
min,0.000000,0.000000,1.000000,0.080000,0.000000,0.000000,0.68000
25%,24999.750000,0.000000,1.000000,25.000000,0.000000,0.000000,10.04000
50%,49999.500000,0.000000,2.000000,39.000000,0.000000,0.000000,24.46000
75%,74999.250000,1.000000,3.000000,53.000000,1.000000,1.000000,33.50000
max,99999.000000,1.000000,3.000000,87.000000,8.000000,9.000000,744.66000

In [8]:
train.describe(include = ['O'])

                 Name     Sex Ticket   Cabin Embarked
count          100000  100000  95377   32134    99750
unique          92144       2  75331   26992        3
top     Johnson, John    male   A/5   C19828        S
freq               31   56114    602       6    72139

In [9]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PassengerId  100000 non-null  int64
 1   Survived     100000 non-null  int64
 2   Pclass       100000 non-null  int64
 3   Name         100000 non-null  object
 4   Sex          100000 non-null  object
 5   Age          96708 non-null   float64
 6   SibSp        100000 non-null  int64
 7   Parch        100000 non-null  int64
 8   Ticket       95377 non-null   object
 9   Fare         99866 non-null   float64
 10  Cabin        32134 non-null   object
 11  Embarked     99750 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.2+ MB

In [10]:
train.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Sex                0
Age             3292
SibSp              0
Parch              0
Ticket          4623
Fare             134
Cabin          67866
Embarked         250
dtype: int64

In [11]:
train['Age'].fillna(train['Age'].mean(), inplace = True)
train.loc[train.Cabin.notnull(), 'Cabin'] = 'Yes'
train.loc[train.Cabin.isnull(), 'Cabin'] = 'No'
train['Ticket'].fillna(train['Ticket'].mean, inplace = True)
train['Fare'].fillna(train['Fare'].mean, inplace = True)
train.dropna(subset=['Embarked'], inplace=True)

In [12]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [16]:
train.Pclass.value_counts()

3    40912
1    30229
2    28609
Name: Pclass, dtype: int64

In [17]:
train[['Pclass', 'Survived']].groupby(['Pclass'], as_index = False).mean()

   Pclass  Survived
0       1  0.579510
1       2  0.524905
2       3  0.247287

In [19]:
train.groupby('Sex').Survived.value_counts()

Sex     Survived
female  1           31124
        0           12631
male    0           44467
        1           11528
Name: Survived, dtype: int64

In [20]:
train[['Sex', 'Survived']].groupby(['Sex'], as_index = False).mean()

      Sex  Survived
0  female  0.711324
1    male  0.205876

In [24]:
train[['Embarked', 'Survived']].groupby(['Embarked'], as_index = False).mean()

  Embarked  Survived
0        C  0.751296
1        Q  0.596976
2        S  0.315294

In [27]:
train.Embarked.value_counts()

S    72139
C    22187
Q     5424
Name: Embarked, dtype: int64

In [30]:
train[['Parch', 'Survived']].groupby(['Parch'], as_index=False).mean()

   Parch  Survived
0      0  0.405127
1      1  0.591555
2      2  0.384643
3      3  0.491335
4      4  0.286036
5      5  0.570997
6      6  0.205882
7      9  0.439394

In [31]:
train[['SibSp', 'Survived']].groupby(['SibSp'], as_index=False).mean()

   SibSp  Survived
0      0  0.426702
1      1  0.433577
2      2  0.454004
3      3  0.399633
4      4  0.375321
5      5  0.189394
6      8  0.385135